## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_role_assignment.rg_reader will be created
  + resource "azurerm_role_assignment" "rg_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0d06dc2f-0911-451a-9cfb-ed0b23c0de82"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/04503e56-9444-4dec-9e6d-badea9220d71/resourceGroups/rg-tf-db-ai-demo"
      + skip_service_principal_aad_check = (known after apply)
    }

  # null_resource.wait_for_rg will be created
  + resource "null_resource" "wait_for_rg" {
      + id = (known after apply)
    }

  # module.databricks.azurerm_databricks_workspace.workspace will be created
  + resource "azurerm_databricks_workspace" "workspace" {
      + customer_managed_key_enabled      = false
      + disk_encryption_set_id            = (known after apply)
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + location                          = "uksouth"
      + managed_disk_identity             = (known after apply)
      + managed_resource_group_id         = (known after apply)
      + managed_resource_group_name       = "db-managed-rg-demo"
      + name                              = "db-workspace-demo"
      + public_network_access_enabled     = false
      + resource_group_name               = "rg-tf-db-ai-demo"
      + sku                               = "trial"
      + storage_account_identity          = (known after apply)
      + workspace_id                      = (known after apply)
      + workspace_url                     = (known after apply)

      + custom_parameters {
          + nat_gateway_name         = (known after apply)
          + no_public_ip             = true
          + public_ip_name           = (known after apply)
          + storage_account_name     = "sadatabricksppdemo"
          + storage_account_sku_name = "Standard_LRS"
          + vnet_address_prefix      = (known after apply)
        }
    }

  # module.databricks.databricks_user.user will be created
  + resource "databricks_user" "user" {
      + acl_principal_id           = (known after apply)
      + active                     = true
      + allow_cluster_create       = false
      + allow_instance_pool_create = false
      + databricks_sql_access      = false
      + disable_as_user_deletion   = (known after apply)
      + display_name               = "PP-Test User"
      + home                       = (known after apply)
      + id                         = (known after apply)
      + repos                      = (known after apply)
      + user_name                  = "pp-test-user@databricks.com"
      + workspace_access           = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>